# SteelElemContourSide1dist Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemContourSide1dist Property
ParameterTypeId Class See Also
---
"Boundary distance 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemContourSide1dist { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemContourSide1dist As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemContourSide1dist {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace